#### ExecuteRules Method (Document, IList(Int32))

---

|  |
| --- |
| PerformanceAdviser Class   See Also |

Executes selected rules on a given document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public IList<FailureMessage> ExecuteRules( 	Document document, 	IList<int> rules ) ``` |

| Visual Basic |
| --- |
| ``` Public Function ExecuteRules ( _ 	document As Document, _ 	rules As IList(Of Integer) _ ) As IList(Of FailureMessage) ``` |

| Visual C++ |
| --- |
| ``` public: IList<FailureMessage^>^ ExecuteRules( 	Document^ document,  	IList<int>^ rules ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     Document on which the rules will be executed.

rules
:   Type:  System.Collections.Generic IList   Int32
     Indices of rules to be executed.

#### Return Value

Failure messages explaining performance problems detected in the document.

# Remarks

Disabled rules are not executed.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PerformanceAdviser Class

ExecuteRules Overload

Autodesk.Revit.DB Namespace